ThuanLeUte/nrf52832-ads1292-fw/app/project/ble_peripheral/ble_app_template/main.c
    if (bsp_afe_get_ecg(&ecg_value) == BS_OK)
    {
     NRF_LOG_RAW_INFO("%d\n", ecg_value);
    }
  }
}

/**
 * @brief         Function for assert macro callback.
 *
 * @param[in]     line_num     Line number of the failing ASSERT call.
 * @param[in]     p_file_name  File name of the failing ASSERT call.
 *
 * @attention     None
 *
 * @return        None
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/* Private function definitions --------------------------------------- */
/**
 * @brief         Function for initializing the timer module.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void timers_init(void)
{
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

  // Create timers.
  err_code = app_timer_create(&m_sensors_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              sensors_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);

  err_code = app_timer_create(&m_battery_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              battery_level_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for the GAP initialization.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void gap_params_init(void)
{
  uint32_t                err_code;
  ble_gap_conn_params_t   gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
                                        (const uint8_t *)DEVICE_NAME,
                                        strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for handling Queued Write Module errors.
 *
 * @param[in]     nrf_error   Error code containing information about what went wrong.
 *
 * @attention     None
 *
 * @return        None
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

/**
 * @brief         Function for ACS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void acs_service_init(void)
{
  uint32_t           err_code;
  ble_acs_init_t     acs_init;

// Initialize ACS
  memset(&acs_init, 0, sizeof(acs_init));

  acs_init.evt_handler          = NULL;
  acs_init.support_notification = true;
  acs_init.p_report_ref         = NULL;

  acs_init.bl_rd_sec        = SEC_OPEN;
  acs_init.bl_cccd_wr_sec   = SEC_OPEN;
  acs_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_acs_init(&m_acs, &acs_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for GYS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void gys_service_init(void)
{
  uint32_t           err_code;
  ble_gys_init_t     gys_init;

// Initialize GYS
  memset(&gys_init, 0, sizeof(gys_init));

  gys_init.evt_handler          = NULL;
  gys_init.support_notification = true;
  gys_init.p_report_ref         = NULL;

  gys_init.bl_rd_sec        = SEC_OPEN;
  gys_init.bl_cccd_wr_sec   = SEC_OPEN;
  gys_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_gys_init(&m_gys, &gys_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for MGS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void mgs_service_init(void)
{
  uint32_t           err_code;
  ble_mgs_init_t     mgs_init;

// Initialize MGS
  memset(&mgs_init, 0, sizeof(mgs_init));

  mgs_init.evt_handler          = NULL;
  mgs_init.support_notification = true;
  mgs_init.p_report_ref         = NULL;

  mgs_init.bl_rd_sec        = SEC_OPEN;
  mgs_init.bl_cccd_wr_sec   = SEC_OPEN;
  mgs_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_mgs_init(&m_mgs, &mgs_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for BAS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void bas_service_init(void)
{
  uint32_t           err_code;
  ble_bas_init_t     bas_init;

  // Initialize Battery Service.
  memset(&bas_init, 0, sizeof(bas_init));

  bas_init.evt_handler          = NULL;
  bas_init.support_notification = true;
  bas_init.p_report_ref         = NULL;
  bas_init.initial_batt_level   = 100;

  // Here the sec level for the Battery Service can be changed/increased.
  bas_init.bl_rd_sec        = SEC_OPEN;
  bas_init.bl_cccd_wr_sec   = SEC_OPEN;
  bas_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_bas_init(&m_bas, &bas_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for DIS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void dis_service_init(void)
{
  uint32_t           err_code;
  ble_dis_init_t     dis_init;

  // Initialize Device Information Service.
  memset(&dis_init, 0, sizeof(dis_init));

  ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

  dis_init.dis_char_rd_sec = SEC_OPEN;

  err_code = ble_dis_init(&dis_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for initializing services that will be used by the application.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void services_init(void)
{
  uint32_t           err_code;
  nrf_ble_qwr_init_t qwr_init = {0};

  // Initialize Queued Write Module.
  qwr_init.error_handler = nrf_qwr_error_handler;

  err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
  APP_ERROR_CHECK(err_code);

  // Initialize Custom Service
  acs_service_init();
  mgs_service_init();
  gys_service_init();

  // Initialize Battery Service.
  bas_service_init();

