ThuanLeUte/nrf52832-ads1292-fw/app/project/ble_peripheral/ble_app_template/main.c
  err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for handling events from the BSP module.
 *
 * @param[in]     event   Event generated by button press.
 *
 * @attention     None
 *
 * @return        None
 */
void bsp_event_handler(bsp_event_t event)
{
  uint32_t err_code;
  switch (event)
  {
  case BSP_EVENT_SLEEP:
    sleep_mode_enter();
    break;

  case BSP_EVENT_DISCONNECT:
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
      APP_ERROR_CHECK(err_code);
    }
    break;

  case BSP_EVENT_WHITELIST_OFF:
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
    {
      err_code = ble_advertising_restart_without_whitelist(&m_advertising);
      if (err_code != NRF_ERROR_INVALID_STATE)
      {
        APP_ERROR_CHECK(err_code);
      }
    }
    break;

  default:
    break;
  }
}

/**
 * @brief         Function for initializing the Advertising functionality.
 *
 * @param[in]     event   Event generated by button press.
 *
 * @attention     None
 *
 * @return        None
 */
static void advertising_init(void)
{
  uint32_t               err_code;
  ble_advertising_init_t init;

  memset(&init, 0, sizeof(init));

  init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
  init.advdata.include_appearance     = false;
  init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
  init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

  init.config.ble_adv_fast_enabled  = true;
  init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
  init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
  init.evt_handler                  = on_adv_evt;

  err_code = ble_advertising_init(&m_advertising, &init);
  APP_ERROR_CHECK(err_code);

  ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**
 * @brief         Function for initializing the nrf log module.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void log_init(void)
{
  ret_code_t err_code = NRF_LOG_INIT(app_timer_cnt_get);
  APP_ERROR_CHECK(err_code);

  NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**
 * @brief         Function for initializing power management.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void power_management_init(void)
{
  ret_code_t err_code;
  err_code = nrf_pwr_mgmt_init();
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for handling the idle state (main loop).
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void idle_state_handle(void)
{
  if (NRF_LOG_PROCESS() == false)
  {
    nrf_pwr_mgmt_run();
  }
}

/**
 * @brief         Function for starting advertising.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void advertising_start(void)
{
  uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for handling the Battery measurement timer timeout.
 *
 * @param[in]     p_context   Pointer to context
 *
 * @attention     None
 *
 * @return        None
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
  UNUSED_PARAMETER(p_context);
  battery_level_update();
}

/**
 * @brief         Function for handling the Body temperature measurement timer timeout.
 *
 * @param[in]     p_context   Pointer to context
 *
 * @attention     None
 *
 * @return        None
 */
static void sensors_meas_timeout_handler(void * p_context)
{
  UNUSED_PARAMETER(p_context);
  sensors_value_update();
}

/**
 * @brief         Function for handling the battery level update
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void battery_level_update(void)
{
  uint8_t battery_level              = 0;
  static  uint8_t battery_cal_time   = 0;
  static  uint16_t sum_battery_level = 0;

  sys_bm_get_level_in_percent(&battery_level);
  sum_battery_level += battery_level;
  battery_cal_time ++;

  if (battery_cal_time >= 10)
  {
    battery_level = sum_battery_level / battery_cal_time;
    // NRF_LOG_INFO( "Battery avg : %d percent", battery_level);
    battery_cal_time  = 0;
    sum_battery_level = 0;

   ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
  }
}

/**
 * @brief         Function for handling the body temperature update
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void sensors_value_update(void)
{
  mpu9250_scaled_data_t acc_data;
  mpu9250_scaled_data_t gyr_data;

  bsp_gyro_accel_get(&acc_data, &gyr_data);

  NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
  NRF_LOG_INFO("Acc X Axis: %d", acc_data.x);
  NRF_LOG_INFO("Acc Y Axis: %d", acc_data.y);
  NRF_LOG_INFO("Acc Z Axis: %d", acc_data.z);
  NRF_LOG_INFO("-----------------------------------");
  NRF_LOG_INFO("Gyr X Axis: %d", gyr_data.x);
  NRF_LOG_INFO("Gyr Y Axis: %d", gyr_data.y);
  NRF_LOG_INFO("Gyr Z Axis: %d", gyr_data.z);
  NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
  NRF_LOG_INFO("");

  ble_acs_acc_update(&m_acs, (uint16_t)acc_data.x, BLE_CONN_HANDLE_ALL, BLE_ACS_AXIS_X_CHAR);
  ble_acs_acc_update(&m_acs, (uint16_t)acc_data.y, BLE_CONN_HANDLE_ALL, BLE_ACS_AXIS_Y_CHAR);
  ble_acs_acc_update(&m_acs, (uint16_t)acc_data.z, BLE_CONN_HANDLE_ALL, BLE_ACS_AXIS_Z_CHAR);

  ble_mgs_mag_update(&m_mgs, (uint16_t)gyr_data.x, BLE_CONN_HANDLE_ALL, BLE_MGS_AXIS_X_CHAR);
  ble_mgs_mag_update(&m_mgs, (uint16_t)gyr_data.y, BLE_CONN_HANDLE_ALL, BLE_MGS_AXIS_Y_CHAR);
  ble_mgs_mag_update(&m_mgs, (uint16_t)gyr_data.z, BLE_CONN_HANDLE_ALL, BLE_MGS_AXIS_Z_CHAR);

  ble_gys_gyr_update(&m_gys, (uint16_t)gyr_data.x, BLE_CONN_HANDLE_ALL, BLE_GYS_AXIS_X_CHAR);
  ble_gys_gyr_update(&m_gys, (uint16_t)gyr_data.y, BLE_CONN_HANDLE_ALL, BLE_GYS_AXIS_Y_CHAR);
  ble_gys_gyr_update(&m_gys, (uint16_t)gyr_data.z, BLE_CONN_HANDLE_ALL, BLE_GYS_AXIS_Z_CHAR);
}

/**
 * @brief         Function for starting application timers.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void application_timers_start(void)
{
  ret_code_t err_code;

  // Start application timers.
  err_code = app_timer_start(m_sensors_timer_id, SENSORS_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);


  err_code =  app_timer_start(m_battery_timer_id, BATT_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/* End of fi le -------------------------------------------------------- */
